{
  "title": "WakaDecoder: Unlocking the Heart of Classical Japan",
  "subtitle": "Transforming your Chinese character expertise into a 1,000-year poetic journey.",
  "sections": [
    {
      "heading": "Welcome, Traveler of the Written Word",
      "content": "Welcome to **WakaDecoder**. As a speaker of Chinese, you possess a 'literary superpower' that most learners spend years trying to acquire: you can already read the soul of the Japanese language. While the spoken languages evolved differently, the written heart of Japan was forged in the fires of the Tang Dynasty. You aren't starting from scratch; you are simply learning a new way to connect the concepts you already know. **Classical Japanese (Kobun)** is not a foreign language to you—it is a familiar landscape seen through a morning mist.",
      "key_points": [
        "Your Kanji knowledge covers 70% of the semantic meaning in Waka.",
        "Classical Japanese aesthetics share deep roots with Tang and Song Dynasty verse.",
        "You are about to bridge the gap between 'knowing the characters' and 'feeling the poem'."
      ]
    },
    {
      "heading": "What is Waka? The 31-Syllable Universe",
      "content": "Before there was Haiku, there was **Waka (和歌)**—literally 'Japanese Song.' For over a millennium, this was the primary way the Japanese elite communicated their deepest emotions: love, grief, and the 'pathos of things' (**Mono no aware / 物の哀れ**). Waka follows a strict structure of **5-7-5-7-7** syllables. It was the 'social media' of the Heian court—used for flirting, politics, and prayer. Within these 31 sounds, poets captured the infinite within the finite.",
      "key_points": [
        "Structure: 31 syllables in a 5-7-5-7-7 rhythm.",
        "Cultural Status: The foundation of all Japanese literary aesthetics.",
        "The rigid structure makes it the perfect 'data set' for learning grammar."
      ]
    },
    {
      "heading": "The WakaDecoder Metaphor: Poetry as Data",
      "content": "To master Waka, we treat each poem like a **structured data set**. \n\n1. **Kanji are the Objects/Constants**: These provide the semantic meaning (e.g., 秋 = Autumn, 人 = Person, 心 = Heart). You already know these!\n2. **Hiragana are the Operators/Functions**: These small symbols (の, は, に, けり) act as the code. They tell you *how* the Kanji relate to one another, indicating time, direction, negation, and emotion.\n\nOur goal is to teach you how these **operators** work. Once you understand the logic of the Hiragana 'connectors,' the poem 'compiles' instantly in your mind.",
      "key_points": [
        "Kanji = Semantic Meaning (The 'What').",
        "Hiragana = Logical Relationship (The 'How' and 'When').",
        "Grammar is the 'code' that executes the poem's meaning."
      ]
    },
    {
      "heading": "Example 1: The Advantage of the Kanji Master",
      "content": "Let's look at the very first poem of the *Ogura Hyakunin Isshu* by Emperor Tenji. Even without knowing Japanese grammar, watch how the Kanji guide you.",
      "example_poem": {
        "text": "秋の田の 庵の苫を あらみ 我が衣手は 露にぬれつつ",
        "romaji": "Aki no ta no / io no toma wo / arami / waga koromode wa / tsuyu ni nuretsutsu",
        "translation": "By the autumn rice fields, in the temporary hut, my sleeves are growing wet with the falling dew.",
        "analysis": "Look at the Kanji: **秋 (Autumn)**, **田 (Rice Field)**, **庵 (Hut)**, **衣 (Sleeves)**, **露 (Dew)**. As a Chinese speaker, you immediately recognize the imagery. The 'Data' is clear. The Hiragana **の** (no) acts like the Chinese **的** or **之**, linking the objects. The ending **つつ** (tsutsu) is a 'loop operator' indicating a continuous action—the sleeves are *continuously* getting wetter."
      }
    },
    {
      "heading": "Example 2: Deep Emotion through Familiar Characters",
      "content": "Classical Japanese uses Kanji to ground abstract emotions in physical reality. In this poem by Ono no Komachi, the Kanji tell a story of fading beauty.",
      "example_poem": {
        "text": "花の色は 移りにけりな いたづらに",
        "romaji": "Hana no iro wa / utsuri ni keri na / itazura ni",
        "translation": "The color of the flowers has faded away, while I spent my life in vain.",
        "analysis": "Identify the Kanji: **花 (Flower)**, **色 (Color)**, **移 (Shift/Fade)**. You recognize **移** as 'change.' When you see **色** and **移** together, you grasp the metaphor of transience. The Hiragana **けりな** (keri-na) provides the 'Poetic Sigh'—the realization of time passing. You provide the meaning; we provide the nuance."
      }
    },
    {
      "heading": "The Roadmap: Your 10-Unit Journey",
      "content": "We have organized your learning into 10 logical units designed to build your 'decoder' piece by piece. We won't waste time on modern small talk; we dive straight into the mechanics of the classical heart.",
      "key_points": [
        "Units 1-3: The Structural Skeleton (Basic particles like の, に, は).",
        "Units 4-6: Time and Memory (Past, Present, and the 'Unrealized' future).",
        "Units 7-9: Logic and Emphasis (Kakari-musubi and conditional 'if/when' logic).",
        "Unit 10: Poetic Nuance (The emotional exclamations that make a poem live)."
      ]
    },
    {
      "heading": "The Emotional Bridge: Mono no Aware",
      "content": "By the end of this course, you won't just be 'translating' Japanese; you will be experiencing it. You are reconnecting with a shared East Asian heritage. When you read a Waka, you are feeling the same 'Autumn Wind' (秋風) that Du Fu or Li Bai described, but distilled into a delicate, 31-syllable crystalline form.",
      "key_points": [
        "Aesthetic continuity from Tang/Song to Heian Japan.",
        "Nature as a mirror for human emotion.",
        "Shared cultural vocabulary (Seasons, Moon, Parting)."
      ]
    }
  ],
  "closing_message": "The brush is in your hand, and the ink is already dry on the page of history. You have the Kanji; now, let us give you the voice. Let’s begin Lesson 1: The Logical Bridge (Particle の)."
}